3) sythetic tests/2) rralloc allocator/fio.txt
 20:07:09 /mnt/rotalloc 🭬
fio --name=seqwrite --directory=. --rw=write --bs=1M --numjobs=6 --size=4G --runtime=300 --time_based --group_reporting
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.37
Starting 6 processes
Jobs: 6 (f=6): [W(6)][100.0%][w=1134MiB/s][w=1134 IOPS][eta 00m:00s]
seqwrite: (groupid=0, jobs=6): err= 0: pid=3463: Thu Feb 26 20:12:09 2026
  write: IOPS=537, BW=538MiB/s (564MB/s)(157GiB/300032msec); 0 zone resets
    clat (usec): min=71, max=11233k, avg=9368.92, stdev=131885.63
     lat (usec): min=80, max=11233k, avg=9387.15, stdev=131885.58
    clat percentiles (usec):
     |  1.00th=[    117],  5.00th=[    130], 10.00th=[    153],
     | 20.00th=[    157], 30.00th=[    161], 40.00th=[    165],
     | 50.00th=[    172], 60.00th=[    180], 70.00th=[    241],
     | 80.00th=[    816], 90.00th=[  29754], 95.00th=[  35390],
     | 99.00th=[  71828], 99.50th=[ 200279], 99.90th=[ 208667],
     | 99.95th=[ 717226], 99.99th=[9328133]
   bw (  KiB/s): min=12288, max=12713335, per=100.00%, avg=805741.60, stdev=158260.29, samples=2459
   iops        : min=   12, max=12415, avg=786.86, stdev=154.55, samples=2459
  lat (usec)   : 100=0.19%, 250=70.25%, 500=5.95%, 750=3.58%, 1000=0.05%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.44%, 20=2.67%, 50=15.02%
  lat (msec)   : 100=1.15%, 250=0.62%, 750=0.01%, 1000=0.01%, 2000=0.03%
  lat (msec)   : >=2000=0.02%
  cpu          : usr=0.08%, sys=2.21%, ctx=49877, majf=1, minf=64
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,161269,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=538MiB/s (564MB/s), 538MiB/s-538MiB/s (564MB/s-564MB/s), io=157GiB (169GB), run=300032-300032msec

Disk stats (read/write):
  nvme0n1: ios=2/1246041, sectors=16/318889944, merge=0/653, ticks=929/39420313, in_queue=39449956, util=99.39%
 marek@ideacentre 🭬🭨/mnt/rotalloc 🭬
 READY▪🭬

*************************************

 20:14:51 /mnt/rotalloc 🭬
fio --name=smallfiles --directory=. --rw=write --bs=4k --numjobs=6 --size=1G --ioengine=psync --time_based --runtime=180 --group_reporting
smallfiles: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37
Starting 6 processes
Jobs: 1 (f=1): [_(5),W(1)][100.0%][w=7KiB/s][w=1 IOPS][eta 00m:00s]     
smallfiles: (groupid=0, jobs=6): err= 0: pid=4013: Thu Feb 26 20:18:04 2026
  write: IOPS=150k, BW=586MiB/s (614MB/s)(110GiB/192326msec); 0 zone resets
    clat (nsec): min=794, max=38954k, avg=2182.16, stdev=72053.06
     lat (nsec): min=825, max=38954k, avg=2226.79, stdev=72054.16
    clat percentiles (nsec):
     |  1.00th=[ 1384],  5.00th=[ 1416], 10.00th=[ 1416], 20.00th=[ 1448],
     | 30.00th=[ 1464], 40.00th=[ 1480], 50.00th=[ 1512], 60.00th=[ 1560],
     | 70.00th=[ 1640], 80.00th=[ 1752], 90.00th=[ 2064], 95.00th=[ 2544],
     | 99.00th=[ 3824], 99.50th=[ 4192], 99.90th=[ 8768], 99.95th=[14912],
     | 99.99th=[73216]
   bw (  MiB/s): min=  121, max=12021, per=100.00%, avg=5479.49, stdev=558.08, samples=248
   iops        : min=31052, max=3077430, avg=1402748.65, stdev=142868.07, samples=248
  lat (nsec)   : 1000=0.46%
  lat (usec)   : 2=87.55%, 4=11.28%, 10=0.64%, 20=0.03%, 50=0.01%
  lat (usec)   : 100=0.04%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.79%, sys=5.60%, ctx=105389, majf=0, minf=70
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,28835846,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=586MiB/s (614MB/s), 586MiB/s-586MiB/s (614MB/s-614MB/s), io=110GiB (118GB), run=192326-192326msec

Disk stats (read/write):
  nvme0n1: ios=0/905214, sectors=0/230520320, merge=0/344, ticks=0/13168668, in_queue=13170697, util=99.26%
 marek@ideacentre 🭬🭨/mnt/rotalloc 🭬
 READY▪🭬

*************************************

 20:20:42 /mnt/rotalloc 🭬
fio --name=allocstress --directory=. --rw=write --bs=4k --numjobs=48 --size=2G --ioengine=psync --time_based --runtime=180 --group_reporting
allocstress: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.37
Starting 48 processes
Jobs: 48 (f=48): [W(48)][100.0%][w=57.2MiB/s][w=14.7k IOPS][eta 00m:00s]
allocstress: (groupid=0, jobs=48): err= 0: pid=4489: Thu Feb 26 20:23:43 2026
  write: IOPS=72.5k, BW=283MiB/s (297MB/s)(49.8GiB/180105msec); 0 zone resets
    clat (nsec): min=1376, max=316522k, avg=661244.90, stdev=8474790.25
     lat (nsec): min=1423, max=316522k, avg=661341.46, stdev=8474849.73
    clat percentiles (nsec):
     |  1.00th=[     1448],  5.00th=[     1576], 10.00th=[     1736],
     | 20.00th=[     1928], 30.00th=[     2008], 40.00th=[     2160],
     | 50.00th=[     2352], 60.00th=[     2512], 70.00th=[     2736],
     | 80.00th=[     2960], 90.00th=[     3376], 95.00th=[     4128],
     | 99.00th=[     7968], 99.50th=[ 61603840], 99.90th=[111673344],
     | 99.95th=[145752064], 99.99th=[208666624]
   bw (  KiB/s): min=16912, max=8064918, per=100.00%, avg=290702.93, stdev=12924.84, samples=17237
   iops        : min= 4228, max=2016215, avg=72672.33, stdev=3231.23, samples=17237
  lat (usec)   : 2=28.40%, 4=66.21%, 10=4.51%, 20=0.08%, 50=0.05%
  lat (usec)   : 100=0.05%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.29%, 250=0.38%, 500=0.01%
  cpu          : usr=0.07%, sys=0.39%, ctx=101396, majf=0, minf=538
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,13058160,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=283MiB/s (297MB/s), 283MiB/s-283MiB/s (297MB/s-297MB/s), io=49.8GiB (53.5GB), run=180105-180105msec

Disk stats (read/write):
  nvme0n1: ios=22/367406, sectors=1392/93893232, merge=150/2123, ticks=1327/23741943, in_queue=23747007, util=98.93%
 marek@ideacentre 🭬🭨/mnt/rotalloc 🭬
 READY▪🭬